{"en":{"intro_alert_3":"We must find a way to shrink them back!","split_op_partial_success_1":"Splitting up large numbers this way will make it easier to deal with two or more-digit divisors!","dividend":"Dividend","intro_alert_1":"Multiple blobs of epic proportion detected!","placeTens":"Tens","split_op_partial_next_instruct_0":"Now you must type in the correct answer for the multiplication.","opDivision":"Operation Divide","split_instruct_2":"Press the sparkly blob as shown to proceed.","end_congrats":"CONGRATULATIONS!","credits":"Made by: RENEGADEWARE","op_instruct_1":"You can also use the keyboard to enter the numbers.","intro_alert_0":"Danger!","speech":"SPEECH","lesson2_end_0":"Now why don’t we try this new technique with the next mega blob!","split_op_success_0":"Nicely done! The blobs have now been split into two.","split_op_partial_next_instruct_2":"If the resulting value is less than zero, then try again with a smaller multiplication number!","instruct_drag_blob_0":"In order to merge the two blobs, simply drag one to another like so.","cancel":"CANCEL","health_warning":"Watch out! Once the health bar is empty, you will have to start over!","attack_instruct_boss_hp_2":"Once it’s empty, the mega blob will be defeated.","lesson2_areaModel_0":"Since division is the inverse of multiplication, you can visualize the equation as the dimensions of an area.","split_instruct_0":"Now we are dealing with a much larger blob!","split_instruct_1":"Let’s split the blob up into two to make our life easier.","lesson1_intro_0":"Dividing a large number can be daunting, but with the right trick, it can be a breeze!","split_op_instruct_3":"Once you are happy with the new split numbers, press the SPLIT button.","lesson2_areaModelDistribute_0":"We can use this model to partially solve the division with smaller numbers.","level3_intro_0":"Watch out! These blobs are not to be trifled with!","enter":"ENTER","on":"ON","split_op_partial_success_0":"Good! The blob’s value has been reduced, and a partial quotient blob has appeared.","split_op_instruct_4":"Remember, both new numbers must be wholly divisible for the split to succeed!","attack_instruct_success_0":"Excellent! We’ve managed to clear the blobs!","placeHundreds":"Hundreds","level1_intro_2":"Those numbers don’t look that scary. We can directly solve the division.","level1_intro_1":"In order to beat the mega blob, we must merge all the blobs into one final quotient blob.","placeOnes":"Ones","attacks":"ATTACKS","split_op_instruct_2":"Simply click on any of the digits to transfer them.","efficient":"EFFICIENT","total_errors":"TOTAL ERROR","lesson2_intro_2":"Fortunately, we have one more trick up our sleeves!","attack_instruct_boss_hp_0":"This is the representation of the mega blob’s health.","quotient":"Quotient","intro_op_0":"According to the latest studies of blobology, the only way to shrink them is by the power of the divide operation.","placeValueDistribute":"Place Value Distribute","divisor":"Divisor","off":"OFF","sound":"SOUND","intro_alert_2":"It seems these blobs came from a lab, and have somehow grown uncontrollably.","split_op_success_3":"Good luck!","split_op_instruct_1":"We will be splitting the blob by transferring its digits to a new blob.","victory":"VICTORY","level1_intro_0":"Look out! Two blobs have appeared.","split_op_instruct_0":"Here you can see a representation of how the blob is going to be split.","end_desc":"You have vanquished all the mega blobs! Peace has returned to the world once more!","op_instruct_2":"Once you feel confident with your answer, press the ENTER button on the numpad (or your keyboard).","lesson1_placeValue_0":"First, let’s take a quick look at how large numbers are arranged by single digit numbers.","split":"SPLIT","errors":"ERRORS","split_op_partial_instruct_1":"First you must specify the number to multiply the divisor. Simply type in the number, and press ENTER.","lesson1_placeValueDistribute_1":"Splitting up a number to be added later is known as the distributive property.","lesson2_intro_0":"This time around, we will be dividing with double-digit divisors.","lesson1_placeValueDistribute_2":"Pay close attention to how the distributive property works!","lesson2_areaModel_1":"In this case, the quotient of the division is the width of the area.","lesson1_intro_1":"Let’s briefly examine a useful mathematical principle to help us.","split_op_partial_success_2":"I’ve said everything that I can to help you, the rest is up to you. Go forth, and defeat the mega blobs!","placeValue":"Place Value","lesson2_intro_1":"It would be too troublesome to deal with these blobs using our current technique.","op_instruct_0":"Now you must solve the operation by typing in the number via the numpad.","split_op_partial_next_instruct_1":"Once you press ENTER, you’ll see that number subtracted from the dividend blob.","intro_op_1":"Divide and conquer, as they say!","music":"MUSIC","split_op_success_2":"Once all the blobs have been merged into the final quotient blob, we will be able to attack.","lesson1_placeValue_1":"These digits are placed by multiples of 10’s, since we use a base 10 number system.","lesson2_areaModelDistribute_1":"Observe how the area is being split into two.","close":"CLOSE","total_score":"TOTAL SCORE","end_thanks":"Thank you for playing!","options":"OPTIONS","new":"NEW GAME","split_op_partial_instruct_0":"Here we are going to reduce the blob’s large number by multiplying the divisor with a number.","intro_op_2":"Go forth, our intrepid hero! Use your mathematical might to vanquish these menacing blobs!","lesson1_end_0":"Let’s go ahead and put this into practice when we face the mega blob!","areaModelDistribute":"Area Model Distribute","split_instruct2_0":"Just as you have done many times before, go ahead a press the sparkly blob.","areaModel":"Area Model","title":"<size=50>Attack on Blob</size>\nDivide and Conquer","split_op_success_1":"You can split the blobs further if you want, but there’s a limit!","continue":"CONTINUE","attack_instruct_boss_hp_1":"As you can see, it has been reduced.","lesson1_placeValueDistribute_0":"Now with that in mind, we can split the dividend up by this principle.","score":"SCORE","lesson2_areaModelDistribute_2":"Adding the split values will then give you the whole answer."}}